flights_app/app/models/flight.rb

  def booked_seats_count
    Booking.where(flight_number: flight_number, departure_date: departure_date).count
---
SELECT COUNT(*) FROM "booking" WHERE "booking"."flight_number" = 'AA101' AND "booking"."departure_date" = '2025-12-29'