flights_app/app/controllers/flights_controller.rb

SELECT "flight".* FROM "flight" WHERE "flight"."flight_number" = 'AA101' AND "flight"."departure_date" = '2025-12-29' LIMIT 1
SELECT "flightservice".* FROM "flightservice" WHERE "flightservice"."flight_number" = 'AA101'
---
  def show
    dep = parse_date_param(params[:departure_date])
    if dep.nil?
      redirect_to root_path, alert: "Invalid departure date."
      return
    end

    @flight = Flight.includes(:flight_service, :aircraft).find_by(
      flight_number: params[:flight_number],
      departure_date: dep
    )